benson20010606/Application-of-High-level-micro-stepping-motor/Controller/Projects/STM32F401RE-Nucleo/Examples/MotionControl/temp/uart6/Src/example_usart.c
	return SET;
}

/**
 * @brief  This function converts a text string into a number.
 * @param  str       The pointer to the text string to convert.
 * @param  pnum      The pointer to the numerical variable.
 * @retval FlagStatus  SET or RESET related to the conversion.
 */
FlagStatus str2num(uint8_t* str, uint32_t* pnum) {
	uint8_t TxtStr_digit, digit;
	uint32_t tenpwr;
	uint32_t number;

	digit = 0;

	while (*(str + digit) != '\0') {
		if (((*(str + digit) >= '0') && (*(str + digit) <= '9'))) {
			digit++;
		} else {
			*pnum = 0;
			return RESET;
		}
	}

	tenpwr = 1;
	number = 0;

	do {
		TxtStr_digit = (*(str + (--digit)));
		number += ((TxtStr_digit - '0') * tenpwr);
		tenpwr *= 10;
	} while (digit);

	*pnum = number;
	return SET;
}

/**
 * @}
 *//* End of ExampleUsartPrivateFunctions */

/**
 * @addtogroup   ExampleUsartExportedFunctions
 * @{
 */

/**
 * @brief  Transmit the initial message to the PC which is connected to the
 *         NUCLEO board via UART.
 */
void USART_TxWelcomeMessage(void) {
	/* Send information to PC via USART */
	USART_Transmit(&huart6, (uint8_t* )"\r\n");
	USART_Transmit(&huart6, (uint8_t* )" X-NUCLEO-IHM02A1\r\n");
	USART_Transmit(&huart6, (uint8_t* )" -------------------------------------------\r\n");
	USART_Transmit(&huart6, (uint8_t* )" Dual L6470 Expansion Board for STM32 NUCLEO\r\n");
	USART_Transmit(&huart6, (uint8_t* )" Stacked on ");
	USART_Transmit(&huart6, NUCLEO_BOARD_NAME);
	USART_Transmit(&huart2, (uint8_t* )" \r\n");
	USART_Transmit(&huart2, (uint8_t* )" X-CUBE-SPN2 v1.1.1\r\n");
	USART_Transmit(&huart2, (uint8_t* )" STMicroelectronics, 2015\r\n\r\n");
}

/**
 * @brief  Send a text string via USART.
 * @param  huart       pointer to a UART_HandleTypeDef structure that contains
 *                     the configuration information for the specified UART module.
 * @param  TextString  The text string to be sent.
 * @note It use the HAL_UART_Transmit function.
 */
void USART_Transmit(UART_HandleTypeDef* huart, uint8_t* TextString) {
	uint8_t TextStringLength;

	/* Calculate the length of the text string to be sent */
	TextStringLength = 0;
	while (TextString[TextStringLength++] != '\0')
		;
	TextStringLength--;

	/* Use the HAL function to send the text string via USART */
	HAL_UART_Transmit(huart, TextString, TextStringLength, 10);
}

/**
 * @brief  Check if any Application Command for L6470 has been entered by USART
 *         so to proceed to decode and perform the command.
 */
void USART_CheckAppCmd(void) {
	/* Checks the UART2 is in idle state */
	if (huart2.State == HAL_UART_STATE_READY) {
		/* Checks one character has been at least entered */
		if (UsartTextString[0] != '\0') {
			/* Decode the entered command string */
			USART_DecodeTextString(UsartTextString, L6470_TextCommandBundle,
					(uint8_t*) L6470_DaisyChainSpiTxStruct,
					(uint8_t*) L6470_DaisyChainSpiRxStruct);
		}

		/* Prepare to receive a text string via USART with UART_IT_RXNE */
		NucleoUsartReceiveIT(&huart2, UsartTextString, USARTTEXTSTRINGSIZE);
	}
	if (huart6.State == HAL_UART_STATE_READY) {
		/* Checks one character has been at least entered */
		if (UsartTextString[0] != '\0') {
			/* Decode the entered command string */
			USART_DecodeTextString(UsartTextString, L6470_TextCommandBundle,
					(uint8_t*) L6470_DaisyChainSpiTxStruct,
					(uint8_t*) L6470_DaisyChainSpiRxStruct);
		}

		/* Prepare to receive a text string via USART with UART_IT_RXNE */
		NucleoUsartReceiveIT(&huart6, UsartTextString, USARTTEXTSTRINGSIZE);
	} 
}

/**
 * @brief  Handle text character just received.
 * @param  huart pointer to a UART_HandleTypeDef structure that contains
 *               the configuration information for the specified UART module.
 * @note To use inside USART2_IRQHandler function.
 */
void USART_ITCharManager(UART_HandleTypeDef* huart) {
	uint8_t UART_Receive_IT_Char;

	UART_Receive_IT_Char = (uint8_t) (huart->Instance->USART_DATA_REGISTER);
	/* Checks the buffer full or retur carriage  */
	if ((huart->RxXferCount == 1) || (UART_Receive_IT_Char == '\r')) {
		huart->RxXferCount += 1;
		huart->pRxBuffPtr -= 1;
		*(huart->pRxBuffPtr) = '\0';

		USART_Transmit(huart, (uint8_t *)"\r\n");

		while (HAL_IS_BIT_SET(huart->Instance->USART_STATUS_REGISTER,
				UART_FLAG_RXNE)) {
		}
		__HAL_UART_DISABLE_IT(huart, UART_IT_RXNE);

		/* Check if a transmit process is ongoing or not */
		if (huart->State == HAL_UART_STATE_BUSY_TX_RX) {
			huart->State = HAL_UART_STATE_BUSY_TX;
		} else {
			/* Disable the UART Parity Error Interrupt */
			__HAL_UART_DISABLE_IT(huart, UART_IT_PE);

			/* Disable the UART Error Interrupt: (Frame error, noise error, overrun error) */
			__HAL_UART_DISABLE_IT(huart, UART_IT_ERR);

			huart->State = HAL_UART_STATE_READY;
		}
	}
}

/**
 * @brief  Print on the PC screen the values of the L6470 Registers.
 * @param  ExpBrd    The addressed Expansion Board
 * @param  L6470_Id  The addressed L6470
 *         
 */
void USART_PrintRegisterValues(uint8_t ExpBrd, uint8_t L6470_Id) {
	uint8_t r;
	uint32_t value;

	/* Initialize the used GPIO for the L6470 nCS related to the addressed X-NUCLEO-IHM02A1 */
	if (BSP_Select(ExpBrd)) {
		USART_Transmit(&huart2, (uint8_t* )"\r\n");

		USART_Transmit(&huart2, (uint8_t* )"Values of the registers of L6470_#");
		USART_Transmit(&huart2, num2hex(L6470_Id, HALFBYTE_F));
		USART_Transmit(&huart2, (uint8_t* )" of ExpBrd_#");
		USART_Transmit(&huart2, num2hex(ExpBrd, HALFBYTE_F));
		USART_Transmit(&huart2, (uint8_t* )"\r\n\r\n");

		for (r = 0; r < L6470REGIDSIZE; r++) {
			value = L6470_GetParam(L6470_Id, (eL6470_RegId_t) r);

			USART_Transmit(&huart2, L6470_GetRegisterName((eL6470_RegId_t) r));
			USART_Transmit(&huart2, (uint8_t* )": ");
			USART_Transmit(&huart2, num2hex(value, DOUBLEWORD_F));
			USART_Transmit(&huart2, (uint8_t* )"\r\n");
		}

		USART_Transmit(&huart2, (uint8_t* )"\r\n");
	}
}

/**
 * @brief  Print on the PC screen the values of the L6470 Registers for all
 *         devices mounted on all stacked X-NUCLEO-IHM02A1.
 */
void USART_PrintAllRegisterValues(void) {
	uint8_t ExpBrd; /* to index the expansion board to be addressed */
	uint8_t L6470_Id; /* to index the L6470 into the daisy chain to be addressed */

	for (ExpBrd = EXPBRD_ID(0); ExpBrd <= EXPBRD_ID(0);
			ExpBrd++) {
		for (L6470_Id = L6470_ID(0);
				L6470_Id <= L6470_ID(L6470DAISYCHAINSIZE - 1); L6470_Id++) {
			USART_PrintRegisterValues(ExpBrd, L6470_Id);
		}
	}
}

/**
 * @brief  Fill the L6470_DaisyChainMnemonic structure.
 *
 * @note   This structure will contain the assigned names about the L6470
 *         devices inside the daisy chain and theirs related motors.
 * @note   Its size and contents is updated at boot in relation to the L6470DAISYCHAINSIZE.
 */
void Fill_L6470_DaisyChainMnemonic(void) {
	uint8_t i;
	char c1 = '0';
	char c10 = '0';

	for (i = 0; i < L6470DAISYCHAINSIZE; i++) {
		if (i < 10) {
			c10 = '0' + i;
			c1 = '\0';
		} else {
			c10 = '0' + (i / 10);
			c1 = '0' + (i - ((i / 10) * 10));
		}

