benson20010606/Application-of-High-level-micro-stepping-motor/Controller/Projects/STM32F401RE-Nucleo/Examples/MotionControl/temp/uart6/Src/example_usart.c
		L6470_DaisyChainMnemonic[i].L6470IdMnemonic[0] = 'L';
		L6470_DaisyChainMnemonic[i].L6470IdMnemonic[1] = '6';
		L6470_DaisyChainMnemonic[i].L6470IdMnemonic[2] = '4';
		L6470_DaisyChainMnemonic[i].L6470IdMnemonic[3] = '7';
		L6470_DaisyChainMnemonic[i].L6470IdMnemonic[4] = '0';
		L6470_DaisyChainMnemonic[i].L6470IdMnemonic[5] = '#';
		L6470_DaisyChainMnemonic[i].L6470IdMnemonic[6] = c10;
		L6470_DaisyChainMnemonic[i].L6470IdMnemonic[7] = c1;
		L6470_DaisyChainMnemonic[i].L6470IdMnemonic[8] = '\0';
		L6470_DaisyChainMnemonic[i].MotorIdMnemonic[0] = 'M';
		L6470_DaisyChainMnemonic[i].MotorIdMnemonic[1] = c10;
		L6470_DaisyChainMnemonic[i].MotorIdMnemonic[2] = c1;
		L6470_DaisyChainMnemonic[i].MotorIdMnemonic[3] = '\0';
	}
}

/**
 * @brief  Convert a number nbr into a string str with 7 characters.
 * @param  nbr The number to be converted.
 * @param  str The container of the converted number into a text in decimal
 *         format.
 * @note   The decimal digits of the number must be maximum 7 so str has to be
 *         able to store at least 7 characters plus '\0'.
 */
void num2str(uint32_t nbr, uint8_t *str) {
	uint8_t k;
	uint8_t *pstrbuff;
	uint32_t divisor;

	pstrbuff = str;

	/* Reset the text string */
	for (k = 0; k < 7; k++)
		*(pstrbuff + k) = '\0';

	divisor = 1000000;

	if (nbr) // if nbr is different from zero then it is processed
	{
		while (!(nbr / divisor)) {
			divisor /= 10;
		}

		while (divisor >= 10) {
			k = nbr / divisor;
			*pstrbuff++ = '0' + k;
			nbr = nbr - (k * divisor);
			divisor /= 10;
		}
	}

	*pstrbuff++ = '0' + nbr;
	*pstrbuff++ = '\0';
}

/**
 * @brief  Convert an integer number into hexadecimal format.
 *
 * @param  num         The integer number to convert.
 * @param  HexFormat   The output format about hexadecimal number.
 *
 * @retval uint8_t*    The address of the string text for the converted hexadecimal number.
 */
uint8_t* num2hex(uint32_t num, eHexFormat HexFormat) {
	static uint8_t HexValue[8 + 1];
	uint8_t i;
	uint8_t dummy;
	uint8_t HexDigits = 0;

	switch (HexFormat) {
	case HALFBYTE_F:
		HexDigits = 1;
		break;
	case BYTE_F:
		HexDigits = 2;
		break;
	case WORD_F:
		HexDigits = 4;
		break;
	case DOUBLEWORD_F:
		HexDigits = 8;
		break;
	}

	for (i = 0; i < HexDigits; i++) {
		HexValue[i] = '\0';
		dummy = (num & (0x0F << (((HexDigits - 1) - i) * 4)))
				>> (((HexDigits - 1) - i) * 4);
		if (dummy < 0x0A) {
			HexValue[i] = dummy + '0';
		} else {
			HexValue[i] = (dummy - 0x0A) + 'A';
		}
	}
	HexValue[i] = '\0';

	return HexValue;
}

/**
 * @}
 *//* End of ExampleUsartExportedFunctions */

/**
 * @}
 *//* End of ExampleUsart */

/**
 * @}
 *//* End of MicrosteppingMotor_Example */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
